Revit 2017 API
RuledSurface Members
The RuledSurface type exposes the following members.
Methods
Name | Description
Create(Curve, Curve)
 Creates a Surface object coincident with the ruled surface joining two bounded generating curves.
Create(Curve, XYZ)
 Creates a Surface object coincident with the ruled surface joining a bounded generating curve to a point.
Dispose |  (Inherited from Surface.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFirstProfileCurve
 Returns a copy of the first profile curve if it is set. If a point was used to define the first profile, this function will return NULL.
GetFirstProfilePoint
 If a point was used to define the first profile, returns a copy of that point. Otherwise return NULL.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSecondProfileCurve
 Returns a copy of the second profile curve if it is set. If a point was used to define the second profile, this function will return NULL.
GetSecondProfilePoint
 If a point was used to define the second profile, returns a copy of that point. Otherwise return NULL.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Surface.)
See Also
RuledSurface Class
Autodesk.Revit.DB Namespace